{
    "home": {
        "title": "Michele Scarpa",
        "heading": "Hi, I'm Michele Scarpa!",
        "subHeading": "Full-stack Software Engineer",
        "description": "I am a fullstack software engineer, primarily focused on web development. I'm passionate about building robust and scalable applications, with extensive expertise across frontend and backend frameworks and ecosystems",
        "description2": "I am a software engineer, primarily focused on web development. I'm passionate about software development and I have extensive expertise in various technologies, including JS, TS, Java, Angular, React, and Spring. Throughout my career, I have also worked on projects involving Digital Signage (Smart TVs - Tizen ) and mobile android applications",
        "articles": "Articoli Tech",
        "readarticle": "Read the complete article",
        "event": "Speaker",
        "event-description": "I'm also a speaker. Here you can find the conferences where I participated as a speaker.",
        "projects": "Projects: From Work to Passion",
        "projects-descriptions": "Here you’ll find an overview of my work: projects from my job, personal initiatives, and collaborative experiments.",
        "workexperiences": "Work Experiences",
        "navhome": "Home",
        "navspeaker": "Speaker",
        "navproject": "Projects",
        "navcv": "CV",
        "navblog": "Blog",
        "gotocv": "Read the complete resume"    
    },
    "project": {
        "title": "From Code to Creation",
        "intro": "Explore the projects I've brought to life, combining creativity and technical expertise to transform ideas into reality."
    },
    "resume": { 
        "contact": "Contact",
        "softskills": "Soft Skills",
        "techskills":"Technical Skills",
        "history_experiences": "Experiences",
        "education": "Education",
        "certifications": "Certifications",
        "skills_acquired": "Skills developed",
        "technologies":"Technology stack adopted",
        "activities": "Key activities and projects",
        "privacy": "I hereby authorize the use of my personal data in accordance to the GDPR 679/16 - \"European regulation on the protection of personal data\"."
    },
    "blog": { 
        "title": "Thoughts in Code and Beyond",
        "intro": "An archive of my insights, discoveries, and journey through the world of programming and more."
    },
     "event": {
        "title": "Tech Contamination",
        "intro": "From code to stage: my commitment to sharing important topics and fostering discussion within the developer community. Thanks to the BacaroTech project, I've become a speaker, and I aim to bring some topics important to me live to audiences. Being able to program is crucial for a developer; being able to talk about how to program is a further step towards greater awareness."
    },
    "common": {
        "langselect": "Language",
        "modal-download-pdf": "Type CV Download"
    }
}