{
    "title": "Curriculum Michele Scarpa",
    "fullName": "Michele Scarpa",
    "mainRoleTitle": "Software Engineer",
    "presentation": "Highly motivated Fullstack Developer with 8+ years of experience in designing, developing, and deploying scalable web applications using React, Angular, and Spring Boot. Proven ability to lead project delivery, mentor junior colleagues, and optimize system performance, resulting in a 20% improvement in application load times",
    "presentationOld": "I'm a software engineer with nearly 10 years of experience in web, mobile, GIS, and Digital Signage applications. I specialize in fullstack development, focusing on context, domain, and technologies to ensure quality and continuous improvement.",
    "contact": {
        "email": "scarpa.michele.90@gmail.com",
        "showPhone": false,
        "phone": "+393483482541",
        "address": {
            "showStreet": false,
            "street": "via Isonzo 45/B",
            "city": "Vigonza, Padua",
            "nearestBigCity": "Padua",
            "useShortAddress": true,
            "zipcode": "35010",
            "country": "Italy"
        }
    },
    "certifications": [
        {
            "id": 3,
            "type": "cert",
            "content": "AWS Certified Developer - Associate",
            "date": "December 2022"
        },
        {
            "id": 2,
            "type": "cert",
            "content": "ISIPM Base - Istituto Italiano di Project Management",
            "date": "April 22"
        },
        {
            "id": 1,
            "type": "cert",
            "content": "Google Professional Data Engineering ",
            "date": "March 2020"
        }
    ],
    "speakers": [
        {
            "id": 1,
            "type": "speaker",
            "content": "GDG Dev Fest Venezia",
            "date": "Novembre 2024",
            "title": "Frontend Roadmap: Beginning Dilemma",
            "description": "Roadmap and tools for the frontend developer road"
        }
    ],
    "studies": [
        {
            "id": 1,
            "type": "study",
            "content": "Università studi Padova",
            "target": "Bachelor's Degree in Information Engineering",
            "date": "2015"
        },
        {
            "id": 2,
            "type": "study",
            "content": "ITIS C.Zuccante",
            "target": "Electronics and Telecommunications Technical Expert",
            "date": "2009"
        }
    ],
    "experiences": [
        {
            "id": 1,
            "showHome": true,
            "type": "work",
            "companyName": "Almaviva Digitaltec",
            "role": "Fullstack Developer",
            "dateEnd": "current",
            "dateEndTime": null,
            "dateStart": "Sep 22",
            "dateStartTime": "2022-09-01",
            "date": "2022 - current",
            "description": "I currently work in Almaviva, one of the largest Italian corporations, specialized in IT solutions for the Public Administration. In this experience I consolidated my role as Senior Fullstack Developer, expanding my skills on enterprise technologies and scalable architectures.",
            "experiencesListShort": [
                "Fullstack development (frontend, backend, database) for enterprise-grade projects.",
                "Delivered two production-level projects for Public Administration.",
                "Mentored junior colleagues, fostering technical and professional growth.",
                "Achieved AWS Developer Associate certification, enhancing skills in cloud solutions."
            ],
            "experiencesList": [
                "<b>Led</b> the fullstack management and successful delivery of two critical enterprise projects for Public Administration, from concept to deployment.",
                "<b>Designed and developed</b> a robust GIS application leveraging Leaflet and Geoserver, significantly improving data visualization and spatial analysis capabilities.",
                "<b>Mentored and guided</b> junior colleagues, fostering skill development and contributing to overall team productivity and knowledge transfer.",
                "<b>Implemented</b> scalable solutions using React, Angular, Java, and Spring Boot, optimizing performance and ensuring seamless integration with PostgresSQL and Postgis databases.",
                "<b>Utilized</b> Docker, Kubernetes, and AWS to streamline deployment pipelines and enhance application resilience in cloud environments.",
                "<b>Achieved</b> AWS Developer Associate certification, demonstrating advanced proficiency in cloud development practices."
            ],
            "experiencesListOld": [
                "Fullstack management of enterprise projects, taking care of frontend, backend and database.",
                "Responsible for the delivery of two projects in production for the Public Administration.",
                "Mentoring of junior colleagues, supporting them in the path of technical and professional growth.",
                "Design and develop a GIS application leveraging GeoServer, a microservices architecture built with Spring Boot, a PostgreSQL database extended with PostGIS, and an Angular front end powered by Leaflet.",
                "Achievement of the AWS Developer Associate certification, strengthening skills in cloud and scalable architectures."
            ],
            "otherExperiences": [
                "Shadowing a post-bootcamp junior developer, contributing to his training until he joined another large company as a frontend and mobile developer."
            ],
            "skillAquiredList": [
                {
                    "name": "React",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Angular",
                    "type": "Frontend",
                    "level": 90
                },
                {
                    "name": "Java",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "Spring Boot",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "NodeJS",
                    "type": "Backend",
                    "level": 70
                },
                {
                    "name": "Meteor",
                    "type": "Backend",
                    "level": 60
                },
                {
                    "name": "PostgresSQL",
                    "type": "Database",
                    "level": 80
                },
                {
                    "name": "Postgis",
                    "type": "Database",
                    "level": 80
                },
                {
                    "name": "Docker",
                    "type": "DevOps & Cloud",
                    "level": 80
                },
                {
                    "name": "Kubernates",
                    "type": "DevOps & Cloud",
                    "level": 60
                },
                {
                    "name": "AWS",
                    "type": "DevOps & Cloud",
                    "level": 60
                },
                {
                    "name": "Leaflet",
                    "type": "GIS",
                    "level": 80
                },
                {
                    "name": "Geoserver",
                    "type": "GIS",
                    "level": 80
                },
                {
                    "name": "Geonode",
                    "type": "GIS",
                    "level": 60
                },
                {
                    "name": "Kamunda",
                    "type": "Workflow Managment",
                    "level": 60
                },
                {
                    "name": "Keycloak",
                    "type": "API & Security",
                    "level": 80
                },
                {
                    "name": "WSO2",
                    "type": "API & Security",
                    "level": 60
                }
            ]
        },
        {
            "id": 1,
            "showHome": true,
            "type": "work",
            "companyName": "Viasat - Greenext",
            "role": "Front End Developer",
            "dateEnd": "Sep 22",
            "dateEndTime": "2022-09-01",
            "dateStart": "Sep 21",
            "dateStartTime": "2021-09-01",
            "date": "2021 - 2022",
            "experiencesListShort": [
                "Frontend development in Angular and React for fleet management and waste collection systems, integrated via GraphQL with .NET/C# backend. ",
                "Advanced use of NX monorepo management, UI libraries (KendoUI, Syncfusion),",
                "Achieved ISIPM Base certification in Project Management."
            ],
            "experiencesList": [
                "<b>Developed and maintained</b> complex frontend applications using React and Angular within an NX - Monorepo architecture, enhancing code reusability and project scalability.",
                "<b>Seamlessly integrated</b> frontend components with .NET/C# backends via GraphQL, ensuring efficient data exchange and robust application functionality.",
                "<b>Implemented</b> advanced UI/UX features and custom components utilizing Kendo UI and Syncfusion libraries, significantly improving user experience and application aesthetics.",
                "<b>Contributed</b> to the full software development lifecycle, from requirements gathering to deployment, ensuring high-quality frontend deliverables."
            ],
            "experiencesListOld": [
                "Development and maintenance of frontend applications in Angular and React for the management of fleets and waste collection services.",
                "Integration with .NET/C# backends via GraphQL, streamlining communication between frontend and database.",
                "Use NX to manage monorepo and scale Angular/React applications.",
                "Implementing advanced components with KendoUI and Syncfusion, improving UX and complex data management.",
                "Achievement of the ISIPM Base certification in Project Management, improving the understanding of the project phases and collaboration with PMs."
            ],
            "description": "I worked for Viasat - Vem Solutions, in particular in the Greennext Technologies Business Unit, specialized in waste management services. In this experience I developed frontend applications in Angular and React, working on solutions for fleet monitoring and management.",
            "skillAquiredList": [
                {
                    "name": "React",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Angular",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "NX - Monorepo",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Kendo UI",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Syncfusion",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": ".Net / C#",
                    "type": "Backend",
                    "level": 50
                },
                {
                    "name": "GraphQL",
                    "type": "API",
                    "level": 60
                }
            ]
        },
        {
            "id": 2,
            "showHome": true,
            "type": "work",
            "companyName": "Red-V - Ennova Researh",
            "role": "Junior Software Engineer",
            "dateStart": "Sep 15",
            "dateStartTime": "2015-09-15",
            "dateEnd": "Sep 21",
            "dateEndTime": "2021-09-01",
            "date": "2015 - 2021",
            "skillAquiredList": [
                {
                    "name": "Java",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "Kotlin",
                    "type": "Backend",
                    "level": 70
                },
                {
                    "name": "JSP",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "SQL",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "JavaScript",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Typescript",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "FFmpeg",
                    "type": "Multimedia Processing",
                    "level": 60
                },
                {
                    "name": "ImageMagick",
                    "type": "Multimedia Processing",
                    "level": 60
                },
                {
                    "name": "Tizen",
                    "type": "Player Digital Signage",
                    "level": 80
                },
                {
                    "name": "Toshiba Professional Monitor",
                    "type": "Player Digital Signage",
                    "level": 60
                },
                {
                    "name": "Samsung Professional Monitor - Tizen OS",
                    "type": "Player Digital Signage",
                    "level": 60
                },
                {
                    "name": "VueJS",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "React",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Angular",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Android",
                    "type": "Player Digital Signage",
                    "level": 80
                },
                {
                    "name": "Openlayer",
                    "type": "GIS",
                    "level": 80
                }
            ],
            "experiencesListShort": [
                "Development of cross-platform digital signage and tracking systems, including real-time public transport monitoring and synchronized LED wall content distribution.",
                "Creation of native Android apps with focus on performance, UX/UI, and secure backend integration using Kotlin and Java.",
                "Advanced frontend development with Vue.js and OpenLayers for spatial data management and interactive geographic visualizations."
            ],
            "experiencesList": [
                "<b>Architected and developed</b> full-stack web and Android Player solutions for Digital Signage, reaching over 500 active installations.",
                "<b>Designed and implemented</b> a real-time Map Tracking System for Public Transport, enhancing operational efficiency for clients.",
                "<b>Boosted user engagement</b>  by developing advanced Digital Signage features, including dynamic content integration for LED Walls.",
                "<b>Contributed significantly to mobile development</b> (Android - Kotlin, Java) and frontend development (Vue.js, GIS, OpenLayers), supporting critical project timelines."
            ],
            "experiencesListOld": [
                "Web and Android Player for Digital Signage: Development of a web and mobile platform optimized for centralized management and distribution of digital content on signage devices, with particular focus on performance and scalability.",
                "Map Tracking System for Public Transport: Implementation of a web and mobile system for real-time tracking of public transport vehicles, integrated with interactive maps and advanced geolocation features to enhance user experience.",
                "Advanced Digital Signage Feature – LED Wall: Design and development of a reliable system for synchronized and simultaneous multimedia content distribution on large-scale LED screens for public events.",
                "Mobile Development (Android – Kotlin, Java): Creation and maintenance of native Android applications with particular attention to UX/UI, high performance, and integration with backend services ensuring security and quality.",
                "Frontend Development (Vue.js, GIS, OpenLayers): Development of advanced frontend interfaces using Vue.js, integrated with GIS solutions through OpenLayers, for web applications managing spatial data and interactive geographic data visualization."
            ],
            "description": "I worked on the development of Digital Signage solutions, initially on Android devices and Java/JSP backends. I have created a client for 'embedded' monitors (Toshiba and Samsung Tizen). I was also able to work on other projects in products and consulting with the following technologies: Vue.js, React, Angular and Android (Kotlin)",
            "longDescription": "During this work experience I initially worked in the Digital Signage sector, contributing to the development of a client application for Android devices and a monolithic backend in Java, with JSP interfaces. The main focus was on the management and optimization of images, videos, fonts and other assets intended for players, who take care of their display. In a second phase, I worked on the creation of a client for 'embedded' monitors - professional displays equipped with APIs and custom browsers, designed for digital signage applications. In addition to perfecting the product, I had the opportunity to participate in several projects, taking advantage of technologies such as Vue.js, React, Angular and developing mobile apps on Android (Kotlin)."
        },
        {
            "id": 3,
            "showHome": false,
            "type": "work",
            "companyName": "IN's mercato",
            "role": "Work & study",
            "dateStart": "Sep 12",
            "dateStartTime": "2012-10-1",
            "dateEnd": "Dec 14",
            "dateEndTime": "2014-12-01",
            "date": "2012 - 2014",
            "hideForPrintable": true,
            "skillAquiredList": [
                {
                    "name": "Management and organizational skills"
                },
                {
                    "name": "problem solving and teamwork"
                }
            ],
            "experiencesList": [
                "Customer services and Cash management",
                "Warehouse and inventory management",
                "Organization of work and collaborators"
            ],
            "description": "To finance my studies, I worked in a discount store, covering various operational roles, including cash management, warehouse, inventory and staff organization. This allowed me to develop management and organizational skills, as well as strengthening my aptitude for problem solving and teamwork."
        }
    ]
}