{
    "title": "Curriculum Michele Scarpa",
    "fullName": "Michele Scarpa",
    "mainRoleTitle": "Software Engineer",
    "presentation": "Sono un ingegnere del software con quasi 10 anni di esperienza nello sviluppo di applicazioni web, mobile, GIS e Digital Signage. Mi occupo di soluzioni fullstack con particolare attenzione al contesto, al dominio e alle tecnologie per garantire qualità e continuo miglioramento.",
    "contact": {
        "email": "scarpa.michele.90@gmail.com",
        "showPhone": true,
        "phone": "+393483482541",
        "address": {
            "showStreet": false,
            "street": "via Isonzo 45/B",
            "city": "Vigonza, Padova",
            "nearestBigCity": "Padova",
            "useShortAddress": true,
            "zipcode": "35010",
            "country": "Italia"
        }
    },

    "certifications": [
        {
            "id": 3,
            "type": "cert",
            "content": "AWS Certified Developer - Associate",
            "date": "Dicembre 2022"
        },
        {
            "id": 2,
            "type": "cert",
            "content": "ISIPM Base",
            "date": "Aprile 22"
        },
        {
            "id": 1,
            "type": "cert",
            "content": "Google Professional Data Engineering ",
            "date": "Marzo 2020"
        }
    ],
    "speakers": [
        {
            "id": 1,
            "type": "speaker",
            "content": "GDG Dev Fest Venezia",
            "date": "Novembre 2024",
            "title": "Frontend Roadmap: Beginning Dilemma",
            "description": "Roadmap e strumenti per la strada del frontend developer"
        }
    ],
    "studies": [
        {
            "id": 1,
            "type": "study",
            "content": "Università studi Padova",
            "target": "Triennale Ingegneria Dell'informazione",
            "date": "2015"
        },
        {
            "id": 2,
            "type": "study",
            "content": "ITIS C.Zuccante",
            "target": "Perito Tecnico Elettronico e telecomunicazioni",
            "date": "2009"
        }
    ],
    "experiences": [
        {
            "id": 1,
            "showHome": true,
            "type": "work",
            "companyName": "Almaviva Digitaltec",
            "role": "Fullstack Developer",
            "dateEnd": "current",
            "dateEndTime": null,
            "dateStart": "Sep 2022",
            "dateStartTime": "2022-09-01",
            "date": "2022 - current",
            "description": "Attualmente lavoro in Almaviva, una delle più grandi corporate italiane, specializzata in soluzioni IT per la Pubblica Amministrazione. In questa esperienza ho consolidato il mio ruolo di Senior Fullstack Developer, ampliando le mie competenze su tecnologie enterprise e su architetture scalabili.",
            "experiencesListShort": [
                "Gestione fullstack (frontend, backend, database) di progetti enterprise.",
                "Responsabile della consegnata di due progetti in produzione per la Pubblica Amministrazione.",
                "Mentoring di colleghi junior, supportandone la crescita tecnica e professionale.",
                "Ottenimento della certificazione AWS Developer Associate, rafforzando competenze su architetture cloud."
            ],
            "experiencesList": [
                "Gestione fullstack di progetti enterprise, curando frontend, backend e database.",
                "Responsabile della delivery di due progetti in produzione per la Pubblica Amministrazione.",
                "Mentoring di colleghi junior, affiancandoli nel percorso di crescita tecnica e professionale.",
                "Affiancamento di uno sviluppatore junior post-bootcamp, contribuendo alla sua formazione fino al suo ingresso in un'altra grande azienda come frontend e mobile developer.",
                "Conseguimento della certificazione AWS Developer Associate, rafforzando le competenze in cloud e architetture scalabili."
            ],
            "skillAquiredList": [
                {
                    "name": "React",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Angular",
                    "type": "Frontend",
                    "level": 90
                },
                {
                    "name": "Java",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "Spring Boot",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "NodeJS",
                    "type": "Backend",
                    "level": 70
                },
                {
                    "name": "Meteor",
                    "type": "Backend",
                    "level": 60
                },
                {
                    "name": "PostgresSQL",
                    "type": "Database",
                    "level": 80
                },
                {
                    "name": "Postgis",
                    "type": "Database",
                    "level": 80
                },
                {
                    "name": "Docker",
                    "type": "DevOps & Cloud",
                    "level": 80
                },
                {
                    "name": "Kubernates",
                    "type": "DevOps & Cloud",
                    "level": 60
                },
                {
                    "name": "AWS",
                    "type": "DevOps & Cloud",
                    "level": 60
                },
                {
                    "name": "Leaflet",
                    "type": "GIS",
                    "level": 80
                },
                {
                    "name": "Geoserver",
                    "type": "GIS",
                    "level": 80
                },
                {
                    "name": "Geonode",
                    "type": "GIS",
                    "level": 60
                },
                {
                    "name": "Kamunda",
                    "type": "Workflow Managment",
                    "level": 60
                },
                {
                    "name": "Keycloak",
                    "type": "API & Security",
                    "level": 80
                },
                {
                    "name": "WSO2",
                    "type": "API & Security",
                    "level": 60
                }
            ]
        },
        {
            "id": 2,
            "showHome": true,
            "type": "work",
            "companyName": "Viasat - Greenext",
            "role": "Front End Developer",
            "dateEnd": "Sep 22",
            "dateEndTime": "2022-09-01",
            "dateStart": "Sep 21",
            "dateStartTime": "2021-09-01",
            "date": "2021 - 2022",
            "experiencesListShort": [
                "Sviluppo frontend in Angular e React per sistemi di gestione flotte e raccolta rifiuti, integrati tramite GraphQL con backend .NET/C#.",
                "Utilizzo avanzato di NX per monorepo, librerie UI come KendoUI e Syncfusion",
                "Certificazione ISIPM Base in Project Management."
            ],
            "experiencesList": [
                "Sviluppo e manutenzione di applicazioni frontend in Angular e React per la gestione di flotte e servizi di raccolta rifiuti.",
                "Integrazione con backend .NET/C# tramite GraphQL, ottimizzando la comunicazione tra frontend e database.",
                "Utilizzo di NX per la gestione di monorepo e scalabilità delle applicazioni Angular/React.",
                "Implementazione di componenti avanzati con KendoUI e Syncfusion, migliorando la UX e la gestione dati complessi.",
                "Conseguimento della certificazione ISIPM Base in Project Management, migliorando la comprensione delle fasi progettuali e la collaborazione con i PM."
            ],
            "description": "Ho lavorato per Viasat - Vem Solutions, in particolare nella Business Unit Greennext Technologies, specializzata nei servizi di gestione dei rifiuti (Waste Management). In questa esperienza ho sviluppato applicazioni frontend in Angular e React, lavorando su soluzioni per il monitoraggio e la gestione delle flotte.",
            "skillAquiredList": [
                {
                    "name": "React",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Angular",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "NX - Monorepo",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Kendo UI",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Syncfusion",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": ".Net / C#",
                    "type": "Backend",
                    "level": 50
                },
                {
                    "name": "GraphQL",
                    "type": "API",
                    "level": 60
                }
            ]
        },
        {
            "id": 3,
            "showHome": true,
            "type": "work",
            "companyName": "Red-V - Ennova Researh",
            "role": "Junior Software Engineer",
            "dateStart": "Sep 15",
            "dateStartTime": "2015-09-15",
            "dateEnd": "Sep 21",
            "dateEndTime": "2021-09-01",
            "date": "2015 - 2021",
            "skillAquiredList": [
               {
                    "name": "Java - JSP - Hibernate",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "SQL",
                    "type": "Backend",
                    "level": 80
                },
                {
                    "name": "JavaScript - Typescript - JQuery",
                    "type": "Frontend",
                    "level": 80
                },               
                {
                    "name": "FFmpeg",
                    "type": "Multimedia Processing",
                    "level": 60
                },
                {
                    "name": "ImageMagick",
                    "type": "Multimedia Processing",
                    "level": 60
                },
                {
                    "name": "Media Player: Android - Tizen",
                    "type": "Player Digital Signage",
                    "level": 80
                },                
                {
                    "name": "Toshiba Professional Monitor",
                    "type": "Player Digital Signage",
                    "level": 60
                },
                {
                    "name": "Samsung Professional Monitor - Tizen OS",
                    "type": "Player Digital Signage",
                    "level": 60
                },
                {
                    "name": "VueJS - React - Angular",
                    "type": "Frontend",
                    "level": 80
                },
                {
                    "name": "Android (Java, Kotlin)",
                    "type": "Player Digital Signage",
                    "level": 80
                },                
                {
                    "name": "Openlayer",
                    "type": "GIS",
                    "level": 80
                }
            ],
             "experiencesListShort": [
                "Sviluppo di sistemi digital signage e tracciamento cross-platform, inclusi monitoraggio in tempo reale dei trasporti pubblici e distribuzione sincronizzata di contenuti su schermi LED.",
                "Creazione di app Android native con attenzione a performance, UX/UI e integrazione sicura con backend, utilizzando Kotlin e Java.",
                "Sviluppo frontend avanzato con Vue.js e OpenLayers per la gestione di dati spaziali e visualizzazioni geografiche interattive."
            ],
            "experiencesList": [
                "Player Web e Android per Digital Signage: Sviluppo di una piattaforma web e mobile ottimizzata per la gestione e distribuzione centralizzata di contenuti digitali su dispositivi di digital signage, con particolare attenzione a performance e scalabilità.",
                "Sistema di tracking su mappa per trasporto pubblico: Realizzazione di un sistema web e mobile per tracciare in tempo reale mezzi pubblici, integrato con mappe interattive e funzionalità avanzate di geolocalizzazione per ottimizzare l'esperienza degli utenti finali.",
                "Funzionalità avanzata Digital Signage -Led Wall: Progettazione e sviluppo di un sistema affidabile per la sincronizzazione e distribuzione simultanea di contenuti multimediali su schermi LED di grandi dimensioni in eventi pubblici.",
                "Mobile Development (Android - Kotlin, Java): Creazione e manutenzione di applicazioni Android native con particolare attenzione a UX/UI, performance elevate e integrazione con servizi backend per garantire sicurezza e qualità.",
                "Frontend Development (Vue.js, GIS, OpenLayers): Sviluppo di interfacce frontend avanzate utilizzando Vue.js integrate con soluzioni GIS tramite OpenLayers, per applicazioni web di gestione spaziale e visualizzazione interattiva di dati geografici."
            ],
            "description": "Ho lavorato allo sviluppo di soluzioni Digital Signage, inizialmente su dispositivi Android e backend Java/JSP. Ho realizzato un client per monitor “embedded” (Toshiba e Samsung Tizen). Ho potuto lavorare anche ad altri progetti in prodotti e in consulenza con le seguenti tecnologie: Vue.js, React, Angular e Android (Kotlin)",
            "longDescription": "Durante questa esperienza lavorativa mi sono inizialmente occupato del settore Digital Signage, contribuendo allo sviluppo di un applicativo client per dispositivi Android e di un backend monolitico in Java, con interfacce JSP. Il focus principale riguardava la gestione e l'ottimizzazione di immagini, video, font e altri asset destinati ai player, che ne curano la visualizzazione. In una seconda fase, ho lavorato alla realizzazione di un client per monitor “embedded” - display professionali dotati di API e browser personalizzati, pensati per applicazioni di digital signage. Oltre a perfezionare il prodotto, ho avuto modo di partecipare a diversi progetti, sfruttando tecnologie come Vue.js, React, Angular e sviluppando app mobile su Android (Kotlin)."
        },
        {
            "id": 4,
            "showHome": false,
            "type": "work",
            "companyName": "INs mercato",
            "role": "Work & study",
            "dateStart": "Sep 12",
            "dateStartTime": "2012-10-1",
            "dateEnd": "Dec 14",
            "dateEndTime": "2014-12-01",
            "date": "2012 - 2014",
            "hideForPrintable": true,
            "skillAquiredList": [
                {
                    "name": "capacità gestionali e organizzative",
                    "type": "softskills"
                },
                {
                    "name": "problem solving e al lavoro in team",
                    "type": "softskills"
                }
            ],
            "experiencesList": [
                "Servizio al cliente e gestione della cassa",
                "Gestione del magazzino e dellinventario",
                "Organizzazione del lavoro e dei collaboratori"
            ],
            "description": "Per finanziare gli studi, ho lavorato in un discount, ricoprendo diversi ruoli operativi, tra cui gestione della cassa, magazzino, inventario e organizzazione del personale. Questo mi ha permesso di sviluppare capacità gestionali e organizzative, oltre a rafforzare la mia attitudine al problem solving e al lavoro in team."
        }
    ]
}